#include <iostream>
/* [인라인(inline) 함수] 
라인 안에서 바로 실행되는 함수

즉, '함수 호출(Call)'을 거치지 않고,
'함수 정의' 자체를 그대로 스크립트에 복사해서 실행한다
쉽게 함수의 코드를 복사해서, 호출 자리에 붙여넣어버리는 것.

중간 과정이 생략되었기에, 시간이 빨라져서 메모리 효율 증가
그러나, 너무 많이 반복되거나, 함수가 복잡하면 오히려 역효과.

결론적으로 인라인 함수 : '반복 횟수가 적고', '함수가 길지 않을 때' 

그러나 현재는 최대한 지양하는 추세
굳이 쓰면 유지보수가 힘들고, 요새 컴파일러는 자기가 알아서 inline
*/

// 매크로 함수
#define M_SQUARE(x) ((x) * (x))

// 인라인 함수
inline int I_SQUARE(int x)
{
    return x * x;
}

int main()
{
    // 매크로 함수는 자료형에 독립적이다. <-> inline은 불가
    std::cout << M_SQUARE(5) << std::endl;
    std::cout << M_SQUARE(3.14) << std::endl;

    // 인라인 함수는 성능 향상 가능, 그러나 복잡한 함수 정의에 한계
    std::cout << I_SQUARE(12) << std::endl;
}